[
    {
        "title": "The A-Frame Cabin Review",
        "summary": "The A-Frame Cabin is retiring soon.",
        "date": "2024-09-17",
        "tags": [
          "lego",
          "fan designs",
          "ideas"
        ],
        "type": "reviews",
        "image": "images/articles/a-frame1.jpg",
        "content": "<p>I had a stockpile of \"insider points\" for the Lego Store so I took a chance on set #21338, The A-Frame Cabin. It's on the list of sets slated to retire at the end of this year and I did not want to miss my chance. </p>\n\n<p>Priced at $179.99, this set is a delightful, cozy, charm. The interior is fully detailed with a kitchenette, seating area, writing desk, and an upstairs bedroom that are all accessible by removing the roof panels.</p>\n\n<img src='images/articles/a-frame2.jpg' alt='interior of cabin' width='500' height='300' loading='lazy'>\n\n<p> There aren't any bold new techniques here, but the build was smooth and enjoyable. As an avid hiker and outdoor enthusiast, this set was the next best thing to being out in the woods. The rear of the cabin even has a little shower area. </p>\n\n<img src='images/articles/a-frame3.jpg' alt='rear of cabin' width='500' height='300' loading='lazy'>\n\n<p> Rounding out the exterior are two mini builds. The first features a tree and a firewood stockpile, while the second one has two trees, a spring, a canoe rack, an otter. The foliage on the trees is a bit sparse but the colors present an autumnal feel that just can't be beat. </p>\n\n<img src='images/articles/a-frame4.jpg' alt='trees' width='500' height='300' loading='lazy'>\n\n<p> It feels a little early for this set to be retiring, but I recommend snatching this set up before it is only available on the aftermarket. It's a charming display piece, play-set, or addition to a wooded area of a Lego city. It's available on the <a href='https://https://www.lego.com/en-us/product/a-frame-cabin-21338' target='_blank' rel='noopener noreferrer' title='A-Frame Cabin'>Lego Website</a> and is slated to retire by December 2024.\n"
      },
    {
        "title": "Bricklink Designer Program Series 5 Sets Revealed!",
        "summary": "Bricklink has chosen the 5 finalists for series 5.",
        "date": "2024-08-21",
        "tags": [
          "lego",
          "bricklink",
          "fan designs",
          "spooky",
          "pirates"
        ],
        "type": "news",
        "image": "images/Articles/bricklinkseries5-1.jpg",
        "content": "<p>Bricklink has announced the next five sets to be released in their Bricklink Designer Program. These sets were designed, submitted, and voted on by fans, with Lego making the final decisions. </p>\n\n<p>The latest sets have some spectacular designs, my personal favorite being <em>Adventure in Transylvania</em>. <em>Thieves of Tortuga</em> will scratch the pirates itch that many fans (myself included) have. <em>The Mushroom Village</em> will be a perfect complement to the series 2 <em>Mushroom House</em>. A cozy little <em>Antique Shop</em> and a <em>Popcorn Wagon</em> round out the remaining sets. </p> <p> There truly is something for everyone here. These will be opened for purchase/crowdfunding on June 3, 2025 at 8 AM PST. All sets that reach 3,000 orders will be made into real Lego sets and a maximum of 30,000 of each will be produced. Check out the finalists below and on the <a href='https://www.bricklink.com/v3/designer-program/series-5/main.page'>Bricklink</a> website.</p> \n\n<img src='images/Articles/bricklinkseries5-2.jpg' alt='The Thieves of Tortuga'>\n<img src='images/Articles/bricklinkseries5-3.jpg' alt='Mushroom Village'>\n<img src='images/Articles/bricklinkseries5-4.jpg' alt='Antique Shop'>\n<img src='images/Articles/bricklinkseries5-5.jpg' alt='Adventure in Transylvania'>\n<img src='images/Articles/bricklinkseries5-6.jpg' alt='Popcorn Wagon'>"
      },
    {
        "title": "LEGO Set Review: Ninjago City Gardens",
        "summary": "An in-depth look at the Ninjago City Gardens LEGO set.",
        "date": "2024-08-20",
        "tags": ["reviews", "lego", "ninjago", "youtube"],
        "type": "reviews",
        "image": "images/ninjago-city-gardens.jpg",
        "content": "<p>This set is one of the largest and most detailed LEGO sets in the Ninjago series.</p><p>Check out the video review below:</p>",
        "video": {
            "type": "youtube",
            "id": "dQw4w9WgXcQ"
        }
    },
    
    {
       "title": "DreamZzz Nightmare Shark Ship",
       "summary": "A Delightful build of a soon to be retiring set.",
       "date": "2024-08-19",
       "tags": [
         "lego",
         "dreamzzz",
         "reviews",
         "spooky"
       ],
       "type": "reviews",
       "image": "",
       "content": "<p> I saw that the Nightmare Shark Ship was on the list of retiring sets for the end of 2024 and I immediately added it to my next-to-buy list for Lego. Walmart.com had the set marked down to $104 from $139.99 and I just couldn't help myself. I've long been intrigued buy the DreamZzz line, but this was my first time purchasing a set and I am very much glad that I did so. </p> <p> Like most, if not all, of the DreamZzz lineup, you can choose from a couple different builds. For the Nightmare Shark Ship you can make it an airship or a ship on wheels. <img src='images/Articles/nightmareshark1.jpg' alt='Nightmare Shark Airship'> <img src='images/Articles/nightmareshark2.jpg' alt='Nightmare Shark Ship on Wheels'> </p> <p> I chose to make it the airship. The build was fun and whimsical and represents everything that the best of Lego can be. I typically focus on my Lego city and modulars, but this was a refreshing change of pace. Once I started the build, I couldn't stop. I put some spooky stories on YouTube, grabbed a cup of coffee, and had a delightful morning of building. The finished product is larger than I expected it to be and I couldn't be happier with it.</p> The set is set 71469, it contains 1389 pieces, contains 4 minifigures, and can be purchased directly from lego <a href='https://www.lego.com/en-us/product/nightmare-shark-ship-71469'>Here</a> As of this writing, Walmart still has it for $104 and it can be purchased <a href='https://www.walmart.com/ip/LEGO-DREAMZzz-Nightmare-Shark-Ship-71469-Construct-Building-Toy-Set-Flying-Pirate-Monster-Truck-Includes-4-Minifigures-Toy-Gift-Tweens-Kids-Ages-10-U/2745867138?classType=REGULAR&athbdg=L1100&from=/search'>Here</a> </p>\n",
       "video": {
            "type": "mp4",
             "src": "images/Articles/nightmareshark.mp4"
     }
    },
   {
       "title": "Exploring the LEGO Dungeons & Dragons Red Dragon's Tale Set",
       "summary": "An in-depth look at the LEGO Dungeons & Dragons Red Dragon's Tale set, its features, and what makes it a must-have for fans.",
       "date": "2024-08-01",
       "tags": ["news", "lego", "new release", "featured post"],
       "type": "news",
       "image": "images/Articles/DND1.jpg",
       "content": "<p>The LEGO Dungeons & Dragons Red Dragon's Tale set (21348) is an extraordinary addition to the LEGO Ideas lineup. This set brings the world of Dungeons & Dragons to life with incredible detail and features that will delight both LEGO enthusiasts and D&D fans alike.</p><p>Featuring a total of 1,637 pieces, this set allows builders to create a captivating scene with a majestic red dragon at the center. The dragon is fully articulated, with movable wings, tail, and head, allowing for dynamic posing and display. The set also includes a detailed terrain base, complete with a treasure hoard and an adventurer minifigure ready to face the dragon.</p><p>The intricate design of the Red Dragon's Tale set showcases LEGO's commitment to high-quality, imaginative builds. From the dragon's fearsome expression to the intricate scaling on its body, every detail has been carefully crafted to provide an immersive building experience. The vibrant red bricks used for the dragon contrast beautifully with the earthy tones of the base, creating a visually stunning display piece.</p><p>One of the standout features of this set is its connection to the beloved Dungeons & Dragons franchise. The inclusion of elements like the treasure hoard, adventurer minifigure, and various weapons and accessories adds a layer of storytelling that fans of the game will appreciate. Whether you're recreating scenes from your favorite campaigns or inventing new adventures, this set provides endless possibilities for imaginative play.</p><p>The Red Dragon's Tale set also comes with a comprehensive instruction manual, making it accessible to builders of all skill levels. The clear, step-by-step instructions ensure a smooth building process, while also providing background information on the set's design and the Dungeons & Dragons universe.</p><p>In addition to being a fantastic build, the Red Dragon's Tale set makes for an impressive display piece. The finished model stands over 12 inches (30 cm) tall and 18 inches (46 cm) wide, making it a striking centerpiece for any LEGO collection. The combination of the dragon's imposing presence and the detailed terrain base creates a dynamic and engaging scene that will capture the attention of anyone who sees it.</p><p>Overall, the LEGO Dungeons & Dragons Red Dragon's Tale set is a must-have for fans of both LEGO and Dungeons & Dragons. Its detailed design, immersive features, and connection to the iconic franchise make it a standout addition to the LEGO Ideas series. Whether you're a seasoned builder or a newcomer to the world of LEGO, this set offers an exciting and rewarding building experience.</p><p>With its impressive size, intricate details, and storytelling potential, the Red Dragon's Tale set is sure to become a favorite among LEGO enthusiasts and Dungeons & Dragons fans alike. Don't miss out on the opportunity to add this incredible set to your collection and bring the magic of Dungeons & Dragons to life in LEGO form.</p>"
   },
   {
       "title": "The Lord of the Rings Barad-dûr LEGO Set (10333)",
       "summary": "An in-depth review of the stunningly detailed Barad-dûr LEGO set, capturing the essence of Sauron's dark tower from The Lord of the Rings.",
       "date": "2024-08-05",
       "tags": ["reviews", "lego", "set review", "featured post"],
       "type": "reviews",
       "image": "images/Articles/baraddur1.jpg",
       "content": "<p>As an avid LEGO enthusiast and a long-time fan of J.R.R. Tolkien's epic saga, \"The Lord of the Rings,\" I was thrilled to get my hands on the Barad-dûr LEGO set (10333). This set, a stunningly detailed replica of the Dark Tower of Sauron, is nothing short of a masterpiece.</p><p>From the moment I opened the box, I was impressed by the sheer number of pieces and the quality of the components. The set contains over 4,000 pieces, each meticulously designed to capture the dark, foreboding atmosphere of Barad-dûr. The instruction manual is extensive, with clear and concise steps that guide you through the building process.</p><p>The build itself is both challenging and rewarding. It took me several days to complete, working a few hours each day. The attention to detail is astounding; every section of the tower is packed with intricate features. From the menacing Eye of Sauron at the top to the crumbling stonework and menacing battlements, the set captures the essence of the fortress in remarkable detail. The designers have done an excellent job of incorporating various building techniques, which keeps the construction process engaging and educational. It's a perfect set for experienced builders looking for a satisfying project.</p><p>Once completed, the Barad-dûr set stands impressively tall and makes a fantastic display piece. The dark color scheme, combined with the detailed textures and architectural features, creates a visually striking model that any \"Lord of the Rings\" fan would be proud to showcase.</p><p>The set includes several unique minifigures, including Sauron himself, which adds a great deal of value and playability. The minifigures are highly detailed, with accurate representations of the characters from the movies.</p><p>Given the size, detail, and overall quality of the Barad-dûr set, I believe it offers excellent value for money. It’s not just a toy; it’s a collector’s item and a testament to LEGO’s commitment to creating high-quality, immersive building experiences.</p><p>The Lord of the Rings Barad-dûr LEGO set (10333) is a must-have for any serious LEGO collector or \"Lord of the Rings\" fan. The combination of intricate details, challenging build, and impressive final model makes it a standout set in the LEGO lineup. I highly recommend this set to anyone looking to add a piece of Middle-earth to their collection.</p><p>For more visuals, check out the gallery below:</p><img src='images/Articles/baraddur1.jpg'><img src='images/Articles/baraddur2.jpg'><img src='images/Articles//baraddur3.jpg'><p>Watch the detailed review video:</p><video src='images/Articles/baraddurvideo.mp4' controls></video>"
   },
   {
       "title": "LEGO Natural History Museum (10326)",
       "summary": "An in-depth review of the LEGO Natural History Museum set, featuring a beautifully detailed replica of a museum with exhibits and architectural charm.",
       "date": "2024-08-05",
       "tags": ["reviews", "lego", "set review"],
       "type": "reviews",
       "image": "images/Articles/history1.jpg",
       "content": "<p>The LEGO Natural History Museum (10326) is a delightful set for both LEGO enthusiasts and museum lovers. The set beautifully captures the essence of a natural history museum with its intricate design and attention to detail. The exterior features a grand facade with classical architectural elements, making it an eye-catching display piece.</p><p>The building experience is engaging and rewarding. With over 2,500 pieces, it’s a satisfying project for both adults and older kids. The instructions are clear and well-organized, making the assembly process smooth. The set includes a variety of building techniques and elements, adding to the fun of putting it together.</p><p>The museum features several rooms, including a fossil hall, a diorama of a dinosaur skeleton, and various exhibits showcasing different aspects of natural history. The attention to detail in these exhibits is impressive, with tiny elements that represent everything from gemstones to ancient artifacts. The set also includes minifigures of museum staff and visitors, adding life to the model.</p><p>This set has a strong educational component. It introduces builders to concepts related to natural history and paleontology in an engaging way. The detailed exhibits and accurate representations can spark interest in these subjects and offer a fun way to learn about history and science.</p><p>Once completed, the LEGO Natural History Museum makes a stunning display piece. Its detailed architecture and rich interior make it a great addition to any LEGO collection. It also stands out as a unique piece in LEGO’s architecture line, offering something different from their typical city or landmark sets.</p><p>Overall, the LEGO Natural History Museum (10326) is a fantastic set that combines impressive design, an engaging building experience, and educational value. It’s a great choice for LEGO enthusiasts who appreciate detailed and complex models, as well as for anyone interested in natural history and museums. Its quality and attention to detail make it a standout piece in any collection.</p><p>For more visuals, check out the gallery below:</p><img src='images/Articles/history1.jpg'><img src='images/Articles/history2.jpg'><p>Watch the detailed review video:</p><video src='images/Articles/historyvideo1.mp4' controls></video>"
   },
   {
       "title": "Previous Review Title",
       "summary": "This is a summary of the previous review.",
       "date": "2024-08-01",
       "tags": ["reviews", "set", "new release"],
       "type": "reviews"
   },
   {
       "title": "Tim Burton's The Nightmare Before Christmas Officially Revealed",
       "summary": "Lego's newest spooky offering has been revealed.",
       "date": "2024-08-01",
       "tags": ["news", "halloween", "spooky", "lego", "featured post"],
       "type": "news",
       "image": "images/Articles/nightmare3.jpg",
       "content": "<p>LEGO has officially unveiled set #21351, based on Tim Burton’s The Nightmare Before Christmas, created from a LEGO Ideas submission by fan designer Simon Scott. This 2,193-piece diorama allows fans to recreate scenes from the 1993 classic movie, including the iconic moon and Spiral Hill. It features eight minifigures, including Jack Skellington, Sally, and Santa Claus, but notably excludes Oogie Boogie. The set includes both Halloween and Christmas elements, making it a versatile display piece. It will be available for $199.99, with early access for LEGO Insiders on September 3, and general availability on September 6.</p><p>For more visuals, check out the gallery below:</p><img src='images/Articles/nightmare1.jpg'><img src='images/Articles/nightmare2.jpg'><img src='images/Articles/nightmare3.jpg'><img src='images/Articles/nightmare4.jpg'>",
       "video": "images/Articles/nightmare.mp4"
   },    
   {
       "title": "Older Review Title",
       "summary": "This is a summary of an older review.",
       "date": "2024-07-01",
       "tags": ["reviews", "minifigure"],
       "type": "reviews"
   },
   {
       "title": "Review 1",
       "summary": "This is a summary of review 1.",
       "date": "2024-07-02",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 2",
       "summary": "This is a summary of review 2.",
       "date": "2024-07-03",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 3",
       "summary": "This is a summary of review 3.",
       "date": "2024-07-04",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 4",
       "summary": "This is a summary of review 4.",
       "date": "2024-07-05",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 5",
       "summary": "This is a summary of review 5.",
       "date": "2024-07-06",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 6",
       "summary": "This is a summary of review 6.",
       "date": "2024-07-07",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 7",
       "summary": "This is a summary of review 7.",
       "date": "2024-07-08",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 8",
       "summary": "This is a summary of review 8.",
       "date": "2024-07-09",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 9",
       "summary": "This is a summary of review 9.",
       "date": "2024-07-10",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "Review 10",
       "summary": "This is a summary of review 10.",
       "date": "2024-07-11",
       "tags": ["reviews", "lego"],
       "type": "reviews"
   },
   {
       "title": "News 1",
       "summary": "This is a summary of news 1.",
       "date": "2024-07-02",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 2",
       "summary": "This is a summary of news 2.",
       "date": "2024-07-03",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 3",
       "summary": "This is a summary of news 3.",
       "date": "2024-07-04",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 4",
       "summary": "This is a summary of news 4.",
       "date": "2024-07-05",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 5",
       "summary": "This is a summary of news 5.",
       "date": "2024-07-06",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 6",
       "summary": "This is a summary of news 6.",
       "date": "2024-07-07",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 7",
       "summary": "This is a summary of news 7.",
       "date": "2024-07-08",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 8",
       "summary": "This is a summary of news 8.",
       "date": "2024-07-09",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 9",
       "summary": "This is a summary of news 9.",
       "date": "2024-07-10",
       "tags": ["news", "lego"],
       "type": "news"
   },
   {
       "title": "News 10",
       "summary": "This is a summary of news 10.",
       "date": "2024-07-11",
       "tags": ["news", "lego"],
       "type": "news"
   }
  
]
